# RibbonButton Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RibbonButton Class
Members See Also
---
This class is the base class of PushButton and PulldownButton.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class RibbonButton : RibbonItem
```

Visual Basic
---
```text
Public Class RibbonButton _
	Inherits RibbonItem
```

Visual C++
---
```text
public ref class RibbonButton : public RibbonItem
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.UI..::..RibbonItem Autodesk.Revit.UI..::..RibbonButton Autodesk.Revit.UI..::..PulldownButton Autodesk.Revit.UI..::..PushButton
# See Also
RibbonButton Members
Autodesk.Revit.UI Namespace